# Pandas Tricks: Real Python Course

## Video 2: Configure Options and Settings at Interpretter Startup

In this video we learn how to set some settings when using pandas

In [2]:
import pandas as pd
import numpy as np

def start():
    options = {
        'display': {
            'max_columns': None,
            'max_colwidth': 25,
            'expand_frame_repr': False,
            'max_rows': 10,
            'max_seq_items': 50,
            'precision': 2, 
            'show_dimensions': False
        },
        'mode': {
            'chained_assignment': None
        }
    }
    
    for category, option in options.items():
            for op, value in option.items():
                pd.set_option(f'{category}.{op}', value)
                
#if __name__ == '__main__':
#    start()
#   del start

In [3]:
start()

In [4]:
data = pd.DataFrame(np.random.randn(50, 3))

In [5]:
data

       0         1     2
0  -1.01  4.52e-01  1.41
1   0.64  6.73e-02  0.20
2  -0.86 -3.00e-01 -0.51
3   1.18  1.75e+00 -0.34
4   0.15 -7.79e-03  0.37
..   ...       ...   ...
45 -0.92  8.88e-01 -0.54
46  0.88 -2.53e-02 -1.40
47  1.01 -2.21e-01  0.73
48  0.55  5.77e-01  0.99
49 -0.21  8.59e-01 -1.08

## Video 3: Make Toy Data Structures with pandas' Testing Module

pandas has a module that allows you to quickly create sample data

In [6]:
import pandas._testing as tm
import numpy as np

tm.N, tm.K = 15, 3
np.random.seed(444)
tm.makeTimeDataFrame(freq="M").head()

               A     B     C     D
2000-01-31  0.36  0.27  0.35 -0.54
2000-02-29  0.38 -0.48 -0.43 -0.89
2000-03-31  1.38  0.30 -0.50  0.11
2000-04-30  1.18 -0.18  0.23 -0.74
2000-05-31 -0.94  1.18 -0.65 -0.08

In [7]:
tm.makeDataFrame().head()

               A     B     C     D
b8jgVbQbug -0.75 -0.10 -0.06  0.04
OKCyyhkEvY  0.50  0.80 -0.17 -1.49
RtcTWq0AMT -0.15  0.51 -0.09 -0.72
vtdamOujY0 -0.35  0.27  1.55 -0.05
tW49Zqe3lC  0.16  0.84  0.69  1.54

In [8]:
[i for i in dir(tm) if i.startswith('make')]

['makeBoolIndex',
 'makeCategoricalIndex',
 'makeCustomDataframe',
 'makeCustomIndex',
 'makeDataFrame',
 'makeDateIndex',
 'makeFloatIndex',
 'makeFloatSeries',
 'makeIntIndex',
 'makeIntervalIndex',
 'makeMissingDataframe',
 'makeMixedDataFrame',
 'makeMultiIndex',
 'makeNumericIndex',
 'makeObjectSeries',
 'makePeriodFrame',
 'makePeriodIndex',
 'makePeriodSeries',
 'makeRangeIndex',
 'makeStringIndex',
 'makeStringSeries',
 'makeTimeDataFrame',
 'makeTimeSeries',
 'makeTimedeltaIndex',
 'makeUIntIndex',
 'make_rand_series']

## Video 4: Take Advantage of Accessor Methods

An Accessor is an interface to access additional methods

In [9]:
import pandas as pd

#the Series object has 4 accessor types
pd.Series._accessors

{'cat', 'dt', 'sparse', 'str'}

In [10]:
addr = pd.Series([
    'Washington DC 20003',
    'Brooklyn, NY 11211-1755',
    'Omaha, NE 68154',
    'Pittsburgh, PA 15211'
])

In [11]:
s = 'hello'
s.upper()

'HELLO'

In [12]:
# to call upper on every item in the series you can't call upper
# yyou have to use an accessor str
addr.str.upper()

0        WASHINGTON DC 20003
1    BROOKLYN, NY 11211-1755
2            OMAHA, NE 68154
3       PITTSBURGH, PA 15211
dtype: object

In [13]:
addr.str.count(r'\d')

0    5
1    9
2    5
3    5
dtype: int64

In [14]:
daterng = pd.Series(pd.date_range('2019', periods=9, freq='Q'))

In [15]:
daterng

0   2019-03-31
1   2019-06-30
2   2019-09-30
3   2019-12-31
4   2020-03-31
5   2020-06-30
6   2020-09-30
7   2020-12-31
8   2021-03-31
dtype: datetime64[ns]

In [16]:
daterng.dt.day_name()

0       Sunday
1       Sunday
2       Monday
3      Tuesday
4      Tuesday
5      Tuesday
6    Wednesday
7     Thursday
8    Wednesday
dtype: object

In [17]:
daterng[daterng.dt.quarter >2]

2   2019-09-30
3   2019-12-31
6   2020-09-30
7   2020-12-31
dtype: datetime64[ns]

In [18]:
daterng[daterng.dt.is_year_end]

3   2019-12-31
7   2020-12-31
dtype: datetime64[ns]

## Video 5: Create a DatetimeIndex from Component Columns

Each column contains a single portion of a date (day, month year)

In [19]:
import pandas as pd
import numpy as np
from itertools import product

In [21]:
datecols=['year', 'month', 'day']
df = pd.DataFrame(list(product([2019, 2020], [1,2], [1,2,3])),
                 columns=datecols)

df['data']=np.random.randn(len(df))

In [22]:
df

    year  month  day  data
0   2019      1    1 -0.26
1   2019      1    2  0.03
2   2019      1    3  0.12
3   2019      2    1 -0.44
4   2019      2    2  0.61
..   ...    ...  ...   ...
7   2020      1    2 -0.97
8   2020      1    3  0.60
9   2020      2    1  0.87
10  2020      2    2 -0.89
11  2020      2    3  2.20

In [23]:
# takes the three columns of datecols and converts them to the index colum
df.index = pd.to_datetime(df[datecols])

In [24]:
#notice that the index is now filled with dates
df

            year  month  day  data
2019-01-01  2019      1    1 -0.26
2019-01-02  2019      1    2  0.03
2019-01-03  2019      1    3  0.12
2019-02-01  2019      2    1 -0.44
2019-02-02  2019      2    2  0.61
...          ...    ...  ...   ...
2020-01-02  2020      1    2 -0.97
2020-01-03  2020      1    3  0.60
2020-02-01  2020      2    1  0.87
2020-02-02  2020      2    2 -0.89
2020-02-03  2020      2    3  2.20

In [25]:
# We can drop the year, month, day columns
df = df.drop(datecols, axis=1)

In [26]:
df

            data
2019-01-01 -0.26
2019-01-02  0.03
2019-01-03  0.12
2019-02-01 -0.44
2019-02-02  0.61
...          ...
2020-01-02 -0.97
2020-01-03  0.60
2020-02-01  0.87
2020-02-02 -0.89
2020-02-03  2.20

In [27]:
#Since we only have one column of data, we can use the squeeze function to convert the DF into a series
df.squeeze()

2019-01-01   -0.26
2019-01-02    0.03
2019-01-03    0.12
2019-02-01   -0.44
2019-02-02    0.61
              ...
2020-01-02   -0.97
2020-01-03    0.60
2020-02-01    0.87
2020-02-02   -0.89
2020-02-03    2.20
Name: data, dtype: float64

## Video 5: Use Categorical Data to Save Time and Space

Large dataframes can take a while to compute certain functions. Categorical data can reduce the time considerable

In [28]:
# Notice there are repeats. Pandas has to store each individually
colors = pd.Series([
    'periwinkle',
    'mint green',
    'burnt orange',
    'periwinkle',
    'burnt orange',
    'rose',
    'rose',
    'mint green',
    'rose',
    'navy'
])

In [29]:
import pandas as pd

colors

0      periwinkle
1      mint green
2    burnt orange
3      periwinkle
4    burnt orange
5            rose
6            rose
7      mint green
8            rose
9            navy
dtype: object

In [31]:
# this will assign an integer for each unique value in colors
mapper = {v: k for k, v in enumerate(colors.unique())}
mapper

{'periwinkle': 0, 'mint green': 1, 'burnt orange': 2, 'rose': 3, 'navy': 4}

In [33]:
as_int = colors.map(mapper)
as_int # as_int has integer values replaces the color name with the corresponding integer value from the mapper dictionary

0    0
1    1
2    2
3    0
4    2
5    3
6    3
7    1
8    3
9    4
dtype: int64

In [34]:
# an alternative approach is to make the colors series to type of category
ccolors = colors.astype('category')
ccolors.cat.categories

Index(['burnt orange', 'mint green', 'navy', 'periwinkle', 'rose'], dtype='object')

In [35]:
ccolors.cat.codes

0    3
1    1
2    0
3    3
4    0
5    4
6    4
7    1
8    4
9    2
dtype: int8

In [36]:
# you do lose from functionality by converting categories
# for example if we want to add an additional color
ccolors.iloc[5]='a new color'

TypeError: Cannot setitem on a Categorical with a new category (a new color), set the categories first

In [37]:
ccolors = ccolors.cat.add_categories(['a new color'])
ccolors # notice that 'a new color' was added to the list of categories

0      periwinkle
1      mint green
2    burnt orange
3      periwinkle
4    burnt orange
5            rose
6            rose
7      mint green
8            rose
9            navy
dtype: category
Categories (6, object): ['burnt orange', 'mint green', 'navy', 'periwinkle', 'rose', 'a new color']

In [39]:
#Now we can insert an item in our list
ccolors.iloc[5]= 'a new color'
ccolors

0      periwinkle
1      mint green
2    burnt orange
3      periwinkle
4    burnt orange
5     a new color
6            rose
7      mint green
8            rose
9            navy
dtype: category
Categories (6, object): ['burnt orange', 'mint green', 'navy', 'periwinkle', 'rose', 'a new color']

## Video 6: Introspect Groupby Objects via Iteration

In [42]:
import pandas as pd

url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/abalone/abalone.data'
cols = ['sex', 'length', 'diam', 'height', 'weight', 'rings']
abalone = pd.read_csv(url, usecols=[0,1,2,3,4,8], names=cols)

abalone.head()

  sex  length  diam  height  weight  rings
0   M    0.46  0.36    0.10    0.51     15
1   M    0.35  0.27    0.09    0.23      7
2   F    0.53  0.42    0.14    0.68      9
3   M    0.44  0.36    0.12    0.52     10
4   I    0.33  0.26    0.08    0.20      7

In [44]:
abalone['ring_quartile'] = pd.qcut(abalone['rings'], q=4, labels = range(1,5))# adds a column called 'ring_quartile'
abalone.head()

  sex  length  diam  height  weight  rings ring_quartile
0   M    0.46  0.36    0.10    0.51     15             4
1   M    0.35  0.27    0.09    0.23      7             1
2   F    0.53  0.42    0.14    0.68      9             2
3   M    0.44  0.36    0.12    0.52     10             3
4   I    0.33  0.26    0.08    0.20      7             1

In [45]:
grouped = abalone.groupby('ring_quartile')

In [47]:
grouped # just returns an address

In [48]:
# calling help on the grouped object we see that groupby objects are iterable
help(grouped.__iter__)

Help on method __iter__ in module pandas.core.groupby.groupby:

__iter__() -> 'Iterator[tuple[Hashable, NDFrameT]]' method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Groupby iterator.

    Returns
    -------
    Generator yielding sequence of (name, subsetted object)
    for each group

In [51]:
for index, frame in grouped: #frame is each record belonging to each ring quartile
    print(f'Ring Quartile: {index}')
    print("-"*16)
    print(frame.nlargest(3, 'weight'), end='\n\n')

Ring Quartile: 1
----------------
     sex  length  diam  height  weight  rings ring_quartile
2619   M    0.69  0.54    0.18    1.71      8             1
1044   M    0.69  0.53    0.17    1.70      8             1
1026   M    0.65  0.52    0.17    1.56      8             1

Ring Quartile: 2
----------------
     sex  length  diam  height  weight  rings ring_quartile
2811   M    0.72  0.57    0.19    2.33      9             2
1426   F    0.74  0.57    0.21    2.25      9             2
1821   F    0.72  0.55    0.20    2.07      9             2

Ring Quartile: 3
----------------
     sex  length  diam  height  weight  rings ring_quartile
1209   F    0.78  0.63    0.21    2.66     11             3
1051   F    0.73  0.60    0.22    2.56     11             3
3715   M    0.78  0.60    0.21    2.55     11             3

Ring Quartile: 4
----------------
     sex  length  diam  height  weight  rings ring_quartile
891    M    0.73  0.59    0.23    2.83     17             4
1763   M    0.78  0.63    0.25    2.78     12             4
165    M    0.72  0.57    0.19    2.55     14             4

In [52]:
# you can return a single group using the .get_group function
grouped.get_group(2).head() # returns rows belonging to the 2nd quartile

   sex  length  diam  height  weight  rings ring_quartile
2    F    0.53  0.42    0.14    0.68      9             2
8    M    0.47  0.37    0.12    0.51      9             2
19   M    0.45  0.32    0.10    0.38      9             2
23   F    0.55  0.41    0.14    0.76      9             2
39   M    0.35  0.29    0.09    0.33      9             2

In [57]:
# you can also call aggregate functions of groups
grouped[['height', 'weight']].agg(['mean', 'median'])

              height        weight
                mean median   mean median
ring_quartile
1               0.11   0.10   0.43   0.37
2               0.14   0.14   0.85   0.84
3               0.16   0.15   1.07   1.06
4               0.16   0.17   1.11   1.07

## Video 7: Mapping Trick for Membership Binning

In [58]:
from typing import Any

countries = pd.Series([
    'United States',
    'Canada',
    'Mexico',
    'Belgium',
    'United Kingdom',
    'Thailand'
])

groups = {
    'North America': ('United States', 'Canada', 'Mexico', 'Greenland'),
    'Europe': ('France', 'Germany', 'United Kingdom', 'Belgium')
}

In [63]:
def membership_map(s: pd.Series, groups: dict,
                  fillvalue:Any=-1) -> pd.Series:
    groups = {x: k for k, v in groups.items() for x in v}
    return s.map(groups).fillna(fillvalue)

In [64]:
membership_map(countries, groups, fillvalue='other')

0    North America
1    North America
2    North America
3           Europe
4           Europe
5            other
dtype: object

## Video 8: How pandas Uses Boolean Operators

Bitwise operators are evaluated first (&, |, ~)
Arithmetic operators are evaluated next (<, <=, >, >=, !=, ==)
Boolean operators are then evaluated(and, not, or)

pandas doesn't use the boolean operators and uses the bitwise operators instead

In [66]:
# The bitwise operators compare the items in similar locations to each other
pd.Series([True, False, True]) & pd.Series(['True', 'True', 'True'])

0     True
1    False
2     True
dtype: bool

In [67]:
# attempts to compare the entire series
pd.Series([True, False, True]) and pd.Series(['True', 'True', 'True'])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [69]:
s = pd.Series(range(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [70]:
s % 2 == 0 & s >3

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## Video 9: Load Data from the Clipboard

In [83]:
import pandas as pd
df = pd.read_clipboard(na_values=[None], parse_dates=['d'])

In [84]:
df

   a       b    c          d
0  0    1.00  inf   1/1/2000
1  2   67.38  NaN   5-Jan-19
2  4  234.86  NaN  7/24/2020
3  6   34.12  NaN        NaT

In [85]:
df.dtypes

a      int64
b    float64
c    float64
d     object
dtype: object

# Video 10: Write pandas Objects Directly to compressed Formats

In [86]:
import pandas as pd

url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/abalone/abalone.data'
cols = ['sex', 'length', 'diam', 'height', 'weight', 'rings']
abalone = pd.read_csv(url, usecols=[0,1,2,3,4,8], names=cols)

abalone.head()

  sex  length  diam  height  weight  rings
0   M    0.46  0.36    0.10    0.51     15
1   M    0.35  0.27    0.09    0.23      7
2   F    0.53  0.42    0.14    0.68      9
3   M    0.44  0.36    0.12    0.52     10
4   I    0.33  0.26    0.08    0.20      7

In [87]:
abalone.to_json('df.json.gz', orient='records', lines=True, compression='gzip') # file created in local directory

In [88]:
#lets save the same dataframe uncompressed and compare the sizes
import os.path
abalone.to_json('df.json', orient='records', lines=True)

In [89]:
# the uncompressed file is nearly 10 times larger than the compressed version
os.path.getsize('df.json')/os.path.getsize('df.json.gz')

9.905475020965616